Wfscl0/RZS_Repository/RES/tmp/RES_Remote_G0B1_base.ioc
#MicroXplorer Configuration settings - do not modify
CAD.formats=
CAD.pinconfig=
CAD.provider=
Extended=true
File.Version=6
GPIO.groupedBy=
KeepUserPlacement=false
Mcu.CPN=STM32G0B1CBT3
Mcu.Family=STM32G0
Mcu.IP0=NVIC
Mcu.IP1=RCC
Mcu.IP2=SYS
Mcu.IPNb=3
Mcu.Name=STM32G0B1C(B-C-E)Tx
Mcu.Package=LQFP48
Mcu.Pin0=VP_SYS_VS_Systick
Mcu.Pin1=VP_SYS_VS_DBSignals
Mcu.PinsNb=2
Mcu.ThirdPartyNb=0
Mcu.UserName=STM32G0B1CBTx
MxCube.Version=6.16.1
MxDb.Version=DB.6.0.161
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC.SysTick_IRQn=true\:3\:0\:false\:false\:true\:false\:true\:false
PCC.Seq0=0
PinOutPanel.RotationAngle=0
ProjectManager.ProjectStructure=
RCC.ADCCLockSelection.Ext=RCC_ADCCLKSOURCE_SYSCLK
RCC.ADCFreq_Value.Ext=16000000
RCC.AHBCLKDivider.Ext=RCC_SYSCLK_DIV1
RCC.AHBCLKDividerARG.Ext=RCC_SYSCLK_DIV1
RCC.AHBFreq_Value=16000000
RCC.APB1CLKDivider.Ext=RCC_HCLK_DIV1
RCC.APB1CLKDividerARG.Ext=RCC_HCLK_DIV1
RCC.APB1TimCLKDivider.Ext=1
RCC.APBFreq_Value=16000000
RCC.APBTimFreq_Value=16000000
RCC.CECCLockSelection.Ext=RCC_CECCLKSOURCE_HSI_DIV488
RCC.CECFreq_Value=32786.88524590164
RCC.ClockType.Ext=RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1
RCC.ClockTypeARG.Ext=RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1
RCC.ClockTypeHCLK.Ext=RCC_CLOCKTYPE_HCLK
RCC.ClockTypePCLK1.Ext=RCC_CLOCKTYPE_PCLK1
RCC.ClockTypeSysClk.Ext=RCC_CLOCKTYPE_SYSCLK
RCC.CodegenConfigPeriph.Ext=true
RCC.CortexFreq_Value=16000000
RCC.DATA_CACHE_ENABLE.Ext=1
RCC.EXTERNAL_CLOCK_VALUE=48000
RCC.EXTERNAL_I2S2_CLOCK_VALUE.Ext=48000
RCC.EnableCSSLSE.Ext=false
RCC.EnableExtClockForI2S.Ext=false
RCC.EnbaleCSS.Ext=false
RCC.ExtClockEnable.Ext=false
RCC.FCLKCortexFreq_Value=16000000
RCC.FDCANFreq_Value=16000000
RCC.FLatency.Ext=FLASH_LATENCY_0
RCC.FamilyName=M
RCC.HCLKFreq_Value=16000000
RCC.HSE_Timout.Ext=100
RCC.HSE_VALUE=8000000
RCC.HSI48_VALUE=48000000
RCC.HSICalibrationValue.Ext=64
RCC.HSISYSCLKDivider.Ext=RCC_HSI_DIV1
RCC.HSISYSCLKDividerARG.Ext=RCC_HSI_DIV1
RCC.HSI_VALUE=16000000
RCC.I2C1CLockSelection.Ext=RCC_I2C1CLKSOURCE_PCLK1
RCC.I2C1Freq_Value=16000000
RCC.I2C2CLockSelection.Ext=RCC_I2C2CLKSOURCE_PCLK1
RCC.I2C2Freq_Value=16000000
RCC.I2S1CLockSelection.Ext=RCC_I2S1CLKSOURCE_SYSCLK
RCC.I2S1Freq_Value=16000000
RCC.I2S2Freq_Value=16000000
RCC.INSTRUCTION_CACHE_ENABLE.Ext=1
RCC.IPParameters=AHBFreq_Value,APBFreq_Value,APBTimFreq_Value,CECFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2S1Freq_Value,I2S2Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPUART1Freq_Value,LPUART2Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,MCO2PinFreq_Value,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PWRFreq_Value,SYSCLKFreq_VALUE,TIM15Freq_Value,TIM1Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
RCC.LPTIM1CLockSelection.Ext=RCC_LPTIM1CLKSOURCE_PCLK1
RCC.LPTIM1Freq_Value=16000000
RCC.LPTIM2CLockSelection.Ext=RCC_LPTIM2CLKSOURCE_PCLK1
RCC.LPTIM2Freq_Value=16000000
RCC.LPUART1CLockSelection.Ext=RCC_LPUART1CLKSOURCE_PCLK1
RCC.LPUART1Freq_Value=16000000
RCC.LPUART2Freq_Value=16000000
RCC.LSCOPinFreq_Value=32000
RCC.LSE_Drive_CapabilityArg.Ext=+LSE_Drive_Capability
RCC.LSE_Timout.Ext=5000
RCC.LSE_VALUE=32768
RCC.LSI_VALUE=32000
RCC.MCO1PinFreq_Value=16000000
RCC.MCO2PinFreq_Value=16000000
RCC.OscillatorType.Ext=RCC_OSCILLATORTYPE_HSI
RCC.PLLM.Ext=RCC_PLLM_DIV1
RCC.PLLN.Ext=8
RCC.PLLP.Ext=RCC_PLLP_DIV2
RCC.PLLPoutputFreq_Value=64000000
RCC.PLLQ.Ext=RCC_PLLQ_DIV2
RCC.PLLQoutputFreq_Value=64000000
RCC.PLLR.Ext=RCC_PLLR_DIV2
RCC.PLLRCLKFreq_Value=64000000
RCC.PREFETCH_ENABLE.Ext=1
RCC.PWRFreq_Value=16000000
RCC.PWR_Regulator_Voltage_Scale.Ext=PWR_REGULATOR_VOLTAGE_SCALE1
RCC.RCC_CEC_Clock_Source_FROM_HSI16.Ext=488
RCC.RCC_MCO1Source.Ext=RCC_MCO1SOURCE_SYSCLK
RCC.RCC_MCO2Div.Ext=RCC_MCO2DIV_1
RCC.RCC_MCO2Source.Ext=RCC_MCO2SOURCE_SYSCLK
RCC.RCC_MCODiv.Ext=RCC_MCODIV_1
RCC.RCC_RTC_Clock_Source_FROM_HSE.Ext=32
RCC.RTCClockSelection.Ext=RCC_RTCCLKSOURCE_LSI
RCC.RTCFreq_Value.Ext=32000
RCC.SYSCLKFreq_VALUE=16000000
RCC.SYSCLKFreq_VALUE1.Ext=16
RCC.SYSCLKFreq_VALUE2.Ext=16
RCC.SYSCLKSource.Ext=RCC_SYSCLKSOURCE_HSI
RCC.SYSCLKSourceARG.Ext=RCC_SYSCLKSOURCE_HSI
RCC.TIM15Freq_Value=16000000
RCC.TIM1Freq_Value=16000000
RCC.USART1CLockSelection.Ext=RCC_USART1CLKSOURCE_PCLK1
RCC.USART1Freq_Value=16000000
RCC.USART2CLockSelection.Ext=RCC_USART2CLKSOURCE_PCLK1
RCC.USART2Freq_Value=16000000
RCC.USART3CLockSelection.Ext=RCC_USART3CLKSOURCE_PCLK1
RCC.USART3Freq_Value=16000000
RCC.USBFreq_Value=48000000
RCC.VCOInputFreq_Value=16000000
RCC.VCOOutputFreq_Value=128000000
RCC.VDD_VALUE.Ext=3.3
RCC.WatchDogFreq_Value.Ext=32000
SYS.DisableDeadBatterySignalsConfig.Ext=SYSCFG_CFGR1_UCPD1_STROBE | SYSCFG_CFGR1_UCPD2_STROBE
VP_SYS_VS_DBSignals.Mode=DisableDeadBatterySignals
VP_SYS_VS_DBSignals.Signal=SYS_VS_DBSignals
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
board=custom
